	
// 6. Из заданной строки получить новую, повторив каждый символ дважды
	
package Task_2_6;
	
import java.util.Scanner;
	
public class Task_2_6 {
	
	public static void main(String[] args) {
	
	System.out.println("-----------------------------------------------------------------------------");
	System.out.println("ПРОГРАММА : ПОЛУЧЕНИЕ ИЗ ЗАДАННОЙ СТРОКИ НОВОЙ, ПОВТОРИВ КАЖДЫЙ СИМВОЛ ДВАЖДЫ");
	System.out.println("-----------------------------------------------------------------------------");
	
	Scanner scanner = new Scanner(System.in);
	
	// Ввод строки
	System.out.println("-----------------");
	System.out.println("Введение строки :");
	System.out.println("-------------------------");
	System.out.print("Введите данные......... :  ");
	
	String line = scanner.nextLine();
	
	Task_2_6_res Input = new Task_2_6_res();
	
	// Вывод на печать начальной строки
	System.out.println("-------------------------------------------------------------------------------");
	System.out.println("Вывод на печать начальной строки : " + line);
	System.out.println("-------------------------------------------------------------------------------");
	
	// ПОЛУЧЕНИЕ ИЗ ЗАДАННОЙ СТРОКИ НОВОЙ, ПОВТОРИВ КАЖДЫЙ СИМВОЛ ДВАЖДЫ
	String new_line = Input.new_line(line);
	
	// Вывод на печать итоговой строки
	System.out.println("-------------------------------------------------------------------------------");
	System.out.println("Вывод на печать итоговой строки : " + new_line);
	System.out.println("-------------------------------------------------------------------------------");
	
	scanner.close();
	}
	
}
