	
// 1. Дан массив названий переменных в camelCase. Преобразовать названия в snake_case.
	
package Task_1_1;
	
public class Task_1_1 {
	
	public static void main(String[] args) {
	
	System.out.println("ПРОГРАММА : ПРЕОБРАЗОВАНИЕ МАССИВА НАЗВАНИЙ ПЕРЕМЕННЫХ ИЗ CAMELCASE В SNAKECASE");
	System.out.println("-------------------------------------------------------------------------------");
	System.out.println("-------------------------------------------------------------------------------");
	
	
	
	
	
	}
	
}
