
/*
	10. Строка X состоит из нескольких предложений,
	каждое из которых кончается точкой,
	восклицательным или вопросительным знаком.
	Определить количество предложений в строке X
*/

package Task_2_10;
	
import java.util.Scanner;
	
public class Task_2_10 {
	
	public static void main(String[] args) {
	
	System.out.println("-------------------------------------------------------");
	System.out.println("ПРОГРАММА : ОПРЕДЕЛЕНИЕ КОЛИЧЕСТВА ПРЕДЛОЖЕНИЙ В СТРОКЕ");
	System.out.println("-------------------------------------------------------");
	
	Scanner scanner = new Scanner(System.in);
	
	// Ввод строки
	System.out.println("-----------------");
	System.out.println("Введение строки :");
	System.out.println("-------------------------");
	System.out.print("Введите данные......... :  ");
	
	String X = scanner.nextLine();
	
	Task_2_10_res Input = new Task_2_10_res();
	
	// Вывод на печать начальной строки
	System.out.println("-------------------------------------------------------------------------------");
	System.out.println("Вывод на печать начальной строки : " + X);
	System.out.println("-------------------------------------------------------------------------------");
	
	// ОПРЕДЕЛЕНИЕ КОЛИЧЕСТВА ПРЕДЛОЖЕНИЙ В СТРОКЕ
	int count = Input.count_sentence(X);
	
	// Расчёт общего количества предложений в строке
	System.out.println("-------------------------------------------------------------------------------");
	System.out.println("Общее количество предложений в строке : " + count);
	System.out.println("-------------------------------------------------------------------------------");
	
	scanner.close();
	
	}
	
}
