	
// 4. В строке найти количество чисел
// Работа со строкой как с массивом символов
	
package Task_1_4;
	
public class Task_1_4_2 {
	
	public static void main(String[] args) {
		
		System.out.println("----------------------------------------------------------------------------------");
		System.out.println("ПРОГРАММА : РАСЧЁТ КОЛИЧЕСТВА ЧИСЕЛ В СТРОКЕ ( СТРОКА ЯВЛЯЕТСЯ МАССИВОМ СИМВОЛОВ )");
		System.out.println("----------------------------------------------------------------------------------");
		
		//Ввод размера массива символов
		System.out.println("---------------------------------");
		System.out.println("Введите размер массива символов :");
		System.out.println("---------------------------------");
		
		int size = Task_1_4_2_res.InputInt();
		
		// Массив символов
		char massiv[] = Task_1_4_2_res.Inp_mass(size);
		
		//char massiv[] = { '8','a', 'c', 'd', ' ','7','7', '8', 'b', 'c', '3', 'j', '5', '6'};
		
		// Вывод массива на печать
		System.out.println("-------------------------");
		System.out.println("Вывод массива на печать :");
		System.out.println("-------------------------");
		
		Task_1_4_2_res.Print_mass(massiv);
		
		// РАСЧЁТ КОЛИЧЕСТВА ЧИСЕЛ В СТРОКЕ И ВЫВОД ЧИСЕЛ НА ПЕЧАТЬ
		
		int counter = Task_1_4_2_res.countNumbers(massiv);
		
		System.out.println("----------------------------------------------");
		System.out.println("Количество чисел в строке-массиве символов : " + counter);
		System.out.println("----------------------------------------------");
	}
}