	
/*
	5. Удалить в строке все лишние пробелы,
	то есть серии подряд идущих пробелов заменить на одиночные пробелы.
	Крайние пробелы в строке удалить.
*/
	
package Task_1_5;

import java.util.Scanner;

import Task_1_4.Task_1_4_res;

public class Task_1_5 {
	
	public static void main(String[] args) {
	
	System.out.println("--------------------------------------------------");
	System.out.println("ПРОГРАММА : УДАЛЕНИЕ В СТРОКЕ ВСЕХ ЛИШНИХ ПРОБЕЛОВ");
	System.out.println("--------------------------------------------------");
	
	Scanner scanner = new Scanner(System.in);
	
	// Ввод начальной строки для удаления всех лишних ппробелов
	System.out.println("-------------------------------------------------------------");
	System.out.println("Введите начальную строку для удаления всех лишних пробелов : ");
	System.out.println("-------------------------------------------------------------");
	System.out.print("Введите данные......... :   ");
	
	String line = scanner.nextLine();
	
	// String line = "1223 7676 nnn 887878 24344343 9999";
	
	Task_1_5_res Inp = new Task_1_5_res();
	
	System.out.println("-----------------------------------------------------------------------");
	System.out.println("Строка после удаления всех лишних пробелов : " + Inp.removeExtraSpaces(line));
	System.out.println("-----------------------------------------------------------------------");
	}

}
