
/*
	5. Удалить в строке все лишние пробелы,
	то есть серии подряд идущих пробелов заменить на одиночные пробелы.
	Крайние пробелы в строке удалить.
*/
// Работа со строкой как с массивом символов
	
package Task_1_5;
	
public class Task_1_5_2 {
	
	public static void main(String[] args) {
		
		System.out.println("----------------------------------------------------------------------------------------");
		System.out.println("ПРОГРАММА : УДАЛЕНИЕ В СТРОКЕ ВСЕХ ЛИШНИХ ПРОБЕЛОВ ( СТРОКА ЯВЛЯЕТСЯ МАССИВОМ СИМВОЛОВ )");
		System.out.println("----------------------------------------------------------------------------------------");
		
		Task_1_5_2_res Input = new Task_1_5_2_res();
		
		//Ввод размера массива символов
		System.out.println("---------------------------------");
		System.out.println("Введите размер массива символов :");
		System.out.println("---------------------------------");
		
		int size = Input.InputInt();
		
		// Массив символов
		char massiv[] = Input.Inp_mass(size);
		
		//char massiv[] = { '-','-', '-', 'd', '-', '-','t','t','-','o','o','o','-','-','-','-','7', '-', '-', 'c', '-', 'j','-', 'j','-', '-'};
		
		// Расчёт длины нового массива символов
		int size1 = Input.Array_length (massiv);
		
		// Вывод массива на печать
		if (size1 > 0)
			{
			System.out.println("-------------------------");
			System.out.println("Вывод массива на печать :");
			System.out.println("-------------------------");
			
			Input.Print_mass(massiv);
			}
		
		// Объявление итогового массива символов
		
		if( size1 > 0 )
			{
			char[] massiv_end = new char[size1];
			
			// УДАЛЕНИЕ В МАССИВЕ СИМВОЛОВ ВСЕХ ЛИШНИХ ПРОБЕЛОВ
			massiv_end = Input.removing_spaces( massiv, size1);
			
			System.out.println("------------------------------------------------------------------------------------------");
			System.out.print("Массив символов после удаления всех лишних пробелов : ");
			System.out.print(massiv_end);
			System.out.println("");
			System.out.println("------------------------------------------------------------------------------------------");
		}
		
		else {
			System.out.println("--------------------------------------------------");
			System.out.println("Начальный массив символов содержит только пробелы");
			System.out.println("--------------------------------------------------");
			}
	}
	
}
