	
/*
	9. Посчитать количество строчных (маленьких)
	и прописных (больших) букв в введенной строке.
	Учитывать только английские буквы.
*/
	
package Task_2_9;
	
import java.util.Scanner;
	
public class Task_2_9 {
	
	public static void main(String[] args) {
	
	System.out.println("----------------------------------------------------------------------------");
	System.out.println("ПРОГРАММА : ПОДСЧЁТ КОЛИЧЕСТВА АНГЛИЙСКИХ СТРОЧНЫХ И ПРОПИСНЫХ БУКВ В СТРОКЕ");
	System.out.println("----------------------------------------------------------------------------");
	
	Scanner scanner = new Scanner(System.in);
	
	// Ввод строки
	System.out.println("-----------------");
	System.out.println("Введение строки :");
	System.out.println("-------------------------");
	System.out.print("Введите данные......... :  ");
	
	String line = scanner.nextLine();
	
	// Вывод на печать начальной строки
	System.out.println("-------------------------------------------------------------------------------");
	System.out.println("Вывод на печать начальной строки : " + line);
	System.out.println("-------------------------------------------------------------------------------");
	
	// ПОДСЧЁТ КОЛИЧЕСТВА АНГЛИЙСКИХ СТРОЧНЫХ И ПРОПИСНЫХ БУКВ В СТРОКЕ
	
	// Подсчёт количества прописных ( больших ) букв в строке
	int upper_case_count = Task_2_9_res.find_upper_case_count(line);
	
	System.out.println("-----------------------------------------------------");
	System.out.println("Количество прописных ( больших ) букв в строке : " + upper_case_count);
	System.out.println("-----------------------------------------------------");
	
	// Подсчёт количества строчных ( маленьких ) букв в строке
	int lower_case_count = Task_2_9_res.find_lower_case_count(line);
	
	System.out.println("------------------------------------------------------");
	System.out.println("Количество строчных ( маленьких ) букв в строке : " + lower_case_count);
	System.out.println("------------------------------------------------------");
	
	scanner.close();
	
	}
	
}
